// ১. জাভাস্ক্রিপ্ট কি জিনিস এইটা কি জানো?

// ২. জাভাস্ক্রিপ্ট কিভাবে কাজ করে সেটা কি জানো?

// ৩. ভেরিয়েবল কি জিনিস?

// ৪. ভেরিয়েবল কিভাবে ডিক্লেয়ার করে 

// ৫. ভেরিয়েবল এর মান কিভাবে চেইঞ্জ করে বা আপডেট করে। 

// ৬. কি কি ধরণের ভেরিয়েবল হয়। সেগুলা কি কি (হিন্টস: Numeric, String, Boolean)

// ৭. জাভাস্ক্রিপ এ primitive and non primitive data types কি কি ? উদাহরণ হিসেবে বলো। 

// ৮. ভেরিয়েবল এর নাম কিভাবে কিভাবে ডিক্লেয়ার করতে হয়। কোন কোন জিনিস নাম এ লেখা যাবে না। অর্থাৎ Variable এর naming convention সম্পর্কে বলো। 

// ৯. দুইটা ভেরিয়েবল এর মধ্যে =, -, *, /, % কিভাবে করে? 

// ১০. শর্টহ্যান্ড গুলো জানতে হবে। বিশেষ করে +=, -=, *=, /= জানতে হবে। 

// ১১.. ++ এবং -- এর কাজ কি ? এইটা কি জানো। 

// ১২ parseInt, parseFloat, toFixed এইগুলা কি করে? 
var a = '70', b = '60.5';
var aValue = parseInt(a);
var bValue = parseFloat(b);
// --------------

// ১৩. Array কি জিনিস। এইটা কিভাবে কাজ করে? কিভাবে Array ডিক্লেয়ার করতে হয় 
let arr = ['man', 'woman', 'other'];
// ১৪. array এর মধ্যে কয়টা উপাদান (element) আছে সেটা কিভাবে বের করে 
let arrayLength = arr.length;
console.log(arrayLength)
// ১৫. array এর উপাদান গুলা এর পজিশন ( index) কিভাবে কাজ করে। কত দিয়ে শুরু হয়। এবং মান কিভাবে চেইঞ্জ হয়। 
let arrayIndex = arr.indexOf('woman');//if index is not found it return -1
console.log(arrayIndex)
// ১৬. কোন একটা উপাদানের index এর মান -১ বলতে কি বুঝায় 

// ১৭. কিভাবে index দিয়ে কোন একটা array এর মধ্যে উপাদান এর মান খুঁজে বের করতে পারো 
arr[arrayIndex]
// ১৮. কিভাবে কোন একটা index পজিশন এ array এর উপাদান এর মান চেইঞ্জ করতে পারবে
arr[arrayIndex] = 'newWoman'
// ১৯. একটা Array এর মধ্যে কোন একটা উপাদান এর মান তোমাকে দেয়া আছে এখন সেটার index তুমি কিভাবে খুঁজে বের করতে পারো?

// ২০. ধরো, কোন একটা ইনডেক্স দিয়ে উপাদান খুঁজতে গেছো। কিন্তু সেটার মান না দিয়ে তোমাকে undefined দেখাচ্ছে। সেটা দেখে তুমি কি বুঝবে? (একটু গুগলে সার্চ দাও। আমরা কোর্স এ এইটা আলোচনা করিনি। তারপরেও চেষ্টা করে দেখো)
// ************value is not assigned that's way it return undefined
// ২১. কোন একটা Array এর মধ্যে লাস্ট উপাদান হিসেবে কোন উপাদান হিসেবে যোগ করতে চাইলে কিভাৱে যোগ করবে। আবার Array থেকে শেষের উপাদান টা বের করে দিতে চাইলে কিভাবে বের করে দিবে
// array.push(element)
// ২২. কোন একটা Array এর মধ্যে প্রথম উপাদান হিসেবে কোন উপাদান হিসেবে যোগ করতে চাইলে কিভাৱে যোগ করবে। আবার Array থেকে প্রথম উপাদান টা বের করে দিতে চাইলে কিভাবে বের করে দিবে
// array.unshift(element)
// ২৩. তুলনা কিভাবে করতে হয়। এইগুলার মানে কি: >, <, ==, !=, <=, >=, ===, !==, &&, ।। 

// ২৪. তোমার কাছে: ৮০০০০ টাকার বেশি হলে তুমি mac কিনবে, ৬০ টাকার বেশি হলে gaming ল্যাপটপ কিনবে, ৪০ হাজার টাকার বেশি হলে lenovo yoga কম্পিউটার কিনবে , ২০ হাজার টাকার বেশি হলে পুরান ল্যাপটপ কিনবে। না হয় তুমি মোবাইল দিয়ে কাজ চালাবে। 
let money = 3999;
if (money > 80000) {
    console.log('Buy a mac')
}
else if (money > 60000) {
    console.log('Buy a gaming laptop')
}
else if (money > 40000) {
    console.log('Buy a Lenovo yoga')
}
else {
    console.log('Moble dia kaj calamu')
}


// ---------------------

// ২৫. আসকে আমার মন ভালো নেই এই কথা ৩৯ বার আউটপুট হিসেবে দেখাও। 
for (let i = 0; i < 39; i++) {
    console.log('Ajke amar mon valo nei')
}
// ২৬. while লুপ কিভাবে কাজ করে

// ২৭. for লুপ কিভাবে কাজ করে 

// ২৮. while লুপ এর মধ্যে লুপ ভেরিয়েবল চেইঞ্জ না করলে কি সমস্যা হয়। 

// ২৯. একটা কোড লিখে ৫৮ থেকে ৯৮ পর্যন্ত যত সংখ্যা আছে সেগুলাকে দেখাও 
for (let i = 58; i <= 98; i++) {
    console.log(i);
}
// ৩০.একটা কোড লিখে ৪১২ থেকে ৪৫৬ পর্যন্ত যত জোর সংখ্যা আছে সেগুলাকে দেখাও  
for (let i = 412; i <= 456; i++) {
    if (i % 2 == 0) { console.log(i); }
}
// ৩১. একটা কোড লিখে ৫৮১ থেকে ৬২৩ পর্যন্ত যত বিজোড় সংখ্যা আছে সেগুলাকে দেখাও
for (let i = 581; i <= 623; i++) {
    if (i % 2) { console.log(i); }
}
// ৩২.while আর for loop এর মধ্যে পার্থক্য কি 

// ৩৩ তুমি এতদিন যা যা জিনিস শিখছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা for লুপ দিয়ে সেই array এর সব উপাদান কে আউটপুট হিসেবে দেখাও। 
const array = ['JS', 'for', 'while', "if else", 'Variable'];
for (let i = 0; i < array.length; i++) {
    console.log(array[i]);
}
for (arr of array) {
    console.log("in 'for of' loop " + arr);
}

// ৩৪. তুমি এতদিন পর্যন্ত যে যে মডেলের মোবাইল ফোন ইউজ করেছো সেগুলার নাম দিয়ে একটা array বানাও। তারপর একটা while লুপ দিয়ে সেই array এর উপাদান গুলা একটা একটা করে আউটপুট হিসেবে দেখাও 
const mobiles = ['Samsung A51', 'Samsung J Prime', 'Samsung S3 neo', 'xaomi redmi note 5 pro', 'Xaomi A2 lite', 'My Fav Tab', 'Oppo F5', 'Xaomi note 5', 'Nokia A2']
let i = 0;
let len = mobiles.length;
while (i < len) {
    console.log(mobiles[i])
    i++
}

// ৩৫. একটা ফর লুপ চালাও। ৩০ থেকে ৮৬ পর্যন্ত। আর এই লুপ ৪৪ এ গেলে ব্রেক করবে। সেই জিনিস কোড করে দেখাও 
for (let i = 30; i <= 86; i++) {
    if (i == 44) {
        break;
    }
}
// ৩৬. তোমার যত বই আছে সেগুলার দাম নিয়ে একটা array লিখে ফেলো। যে বই গুলোর দাম ২০০ টাকার উপরে সেগুলাকে স্কিপ করবে। অর্থাৎ সেগুলাকে আউটপুট হিসেবে দেখাবে না। বাকিদের কে আউটপুট হিসেবে দেখাবে। দেখো করতে পারো কিনা। 
const bookPrices=[120,324,55556,33333,432,20,300,200,199]
for (let i = 0; i <bookPrices.length; i++) {
    if (bookPrices[i]>200) {
        continue;
    }
    console.log(bookPrices[i])
}
